FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/CRM_ВыгрузкаАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВыгрузкаАвтомобилей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Марка1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МоделиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектация1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поколение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПоколенияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СерииАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_КомплектацииАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МодификацииАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЦветаАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Салон1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ОтделкиСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветCRM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрейдИн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Автомобили</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЗаказНаАвтомобиль</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Comment>VIN-код автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Comment>Дата выпуска автомобиля</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация об автомобиле</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Comment>Вариант комплектации автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДвигателя</Name>
					<Comment>№ двигателя автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКузова</Name>
					<Comment>№ кузова автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерШасси</Name>
					<Comment>№ шасси автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>Цвет автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКод</Name>
					<Comment>Код лакокрасочного покрытия</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Comment>Тип кузова автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКузовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Comment>Тип двигателя автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКПП</Name>
					<Comment>Тип КПП автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСалона</Name>
					<Comment>Тип салона автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГаражный</Name>
					<Comment>Гаражный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Comment>Продавец автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаГарантии</Name>
					<Comment>Дата начала гарантийного срока</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияГарантии</Name>
					<Comment>Дата окончания гарантийного срока</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальныйVIN</Name>
					<Comment>Оригинальный VIN</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись об автомобиле</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата создания записи об автомобиле</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Включать автомобиль в прайс-лист</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидВключенияВПрайсЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>атИнформация</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDСайта</Name>
					<Comment>GUIDСайта автосервиса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленоГБО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленКондиционер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленРефрежератор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прослеживаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_МаркаАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_КрасныйСток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка_црм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель_црм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МоделиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поколение_црм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПоколенияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия_црм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СерииАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_црм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЦветаАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделка_црм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ОтделкиСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модификация_црм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МодификацииАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/црмОбщиеФункции/Ext/Module.bsl
Функция НастройкаСкладовДляВыгрузкиАвто() Экспорт
	
	Возврат Справочники.CRM_НастройкиПодключенияПоСалонам.НайтиПоКоду("000000001");	
КонецФункции 

Функция НастройкаСкладовДляВыгрузкиАвтоСПробегом() Экспорт
	
	Возврат Справочники.CRM_НастройкиПодключенияПоСалонам.НайтиПоКоду("000000010");
	
КонецФункции


Функция ДатаВыгрузкиАвто() Экспорт                                                 
	
	Попытка
		Возврат Дата(Справочники.CRM_НастройкаПодключения.CRM_ДатаВыгрузкиАвто.Значение);
	Исключение	
	КонецПопытки;	
	
КонецФункции	                                                                   

Функция СкладыДляВыгрузкиАвто() Экспорт 
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Подразделение КАК Подразделение
	//                      |ИЗ
	//                      |	Справочник.CRM_НастройкиПодключенияПоСалонам.Подразделения КАК CRM_НастройкиПодключенияПоСалонамПодразделения
	//                      |ГДЕ
	//                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка = &Ссылка");
	//Запрос.УстановитьПараметр("Ссылка", НастройкаСкладовДляВыгрузкиАвто());
	//
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СкладыКомпании.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.СкладыКомпании КАК СкладыКомпании
	                      |ГДЕ
	                      |	НЕ СкладыКомпании.ПометкаУдаления
	                      |	И СкладыКомпании.тт_КатегорияСклада = &Категория");
	Запрос.УстановитьПараметр("Категория", Справочники.тт_КатегорияСклада.НайтиПоКоду("000000009"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ДобавитьАвтоВВыгрузку(Авто) Экспорт
	
	//Обр = Обработки.БТ_црмОтправитьАвтомобильСПробегом.Создать();
	//Обр.Автомобиль = авто;
	//обр.ЗаполнитьАвто();
	Наб = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.СоздатьНаборЗаписей();
	Наб.Отбор.Автомобиль.Установить(Авто);
	Наб.Прочитать();
	Если Наб.Количество() Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Запись = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	
	Если 1 = 2 Тогда
		Авто = Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;	
	
	Запись.Автомобиль = Авто;
	Запись.Марка1С = Авто.БТ_МаркаАвто;
	Запись.Модель1С = Авто.Модель;
	Запись.Комплектация1С = Авто.ВариантКомплектации;
	Запись.Цвет1С = Авто.Цвет;
	Запись.Салон1С = Авто.ТипСалона;
	Запись.НеВыгружать = Истина;   
	
	Реквизиты = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.ОбязательныеРеквизиты();
	Для Каждого Реквизит Из Реквизиты Цикл
		Если ЗначениеЗаполнено(Авто[Реквизит+"_црм"]) Тогда
			Запись[Реквизит] = Авто[Реквизит+"_црм"];
		КонецЕсли;	
	КонецЦикла;	
	Запись.Записать();
		
КонецПроцедуры 

Функция ТребуетсяВыгрузкаПоступления(Документ) Экспорт
	
	ДатаВыгрузки = ДатаВыгрузкиАвто();
	
	Если Не ЗначениеЗаполнено(ДатаВыгрузки) Или Документ.Дата < ДатаВыгрузки Тогда
		
		Возврат Ложь;
		
	КонецЕсли;	
	
	МассивСкладов = СкладыДляВыгрузкиАвто();
	
	Возврат МассивСкладов.Найти(Документ.СкладКомпании) <> Неопределено;
	
КонецФункции

Функция МаркаДляВыгрузкиАвто(Марка) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Марка КАК Марка
	                      |ИЗ
	                      |	Справочник.CRM_НастройкиПодключенияПоСалонам.Марки КАК CRM_НастройкиПодключенияПоСалонамПодразделения
	                      |ГДЕ
	                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка = &Ссылка
						  |	И CRM_НастройкиПодключенияПоСалонамПодразделения.Марка = &Марка");
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаСкладовДляВыгрузкиАвтоСПробегом());
	Запрос.УстановитьПараметр("Марка", Марка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции	

Функция ВыгрузкаВЦРМ() Экспорт
	ДатаВыгрузки = ДатаВыгрузкиАвто();
	
	Возврат ЗначениеЗаполнено(ДатаВыгрузки) и ДатаВыгрузки < ТекущаяДатаСеанса();
КонецФункции
